OP - Rails Blog/app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Really, really boring blog. "], ["article_id", 5], ["created_at", "2015-02-17 17:57:45.539317"], ["updated_at", "2015-02-17 17:57:45.539317"]]
---
	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)